---
kind: property
id: P:Autodesk.Revit.DB.Connector.Owner
zh: 连接件、接口
source: html/8a4a393c-f2e1-0a23-d5b2-ea9680f4fbf5.htm
---
# Autodesk.Revit.DB.Connector.Owner Property

**中文**: 连接件、接口

The host of the connector.

## Syntax (C#)
```csharp
public Element Owner { get; }
```

## Remarks
The element that contains this connector. It may also contain other connectors.